---
kind: enumMember
id: F:Autodesk.Revit.DB.DirectShapeReferencingOption.Referenceable
enum: Autodesk.Revit.DB.DirectShapeReferencingOption
source: html/6c3c17c6-8b68-27da-aba4-cf62da3ec58c.htm
---
# Autodesk.Revit.DB.DirectShapeReferencingOption.Referenceable

The associated DirectShape may be dimensioned and/or otherwise referenced.